from fibonacci import caching_fibonacci
import ferengi

# Головне меню з завданнями
main_menu = '''1. Ряд Фібоначчі
2. Прибутки
3. Аналізатор логів
4. Бот помічник'''

# Виводимо головне меню перший раз
print(main_menu)

# Отримуємо функцію fibonacci ще до запуску безкінечного циклу,
# щоб кеш розрахунків зберігався між його ітераціями
fib = caching_fibonacci()

# Продовжуємо виконання, поки користувач не вийде з програми
while True:
    # Просимо вибрати номер завдання
    action = input('Введіть номер завдання для запуску, або щось інше для виходу: ')

    match action:
        case '1':

            num = input('Введіть число для обчислення: ')

            #  Порожній рядок перед виводом результатів, для краси
            print('\n')

            # Перевіряємо, чи введене є числом
            if num.isnumeric():
                print(fib(int(num)))
            else:
                print('Введені дані не є числом')

        case '2':
            text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."
            
            total_income = ferengi.sum_profit(text, ferengi.generator_numbers)

            print(f"Загальний дохід: {total_income}")

        case '3':
            print('Для аналізу файлу логів, виконайте: \'python logs_analyzer [шлях_до_файлу_логів] {рівень_логування}\'')
        
        case '3':
            print('Для запуску бота, виконайте: \'python bot\'')

        case _:
            #  Виходимо, якщо користувач ввів будь-що, окрім вірного номера завдання
            print('На все добре')
            break
    
    # Порожній рядок після результатів, теж для краси
    print('\n')

    # Не виводимо меню одразу, даючи користувачу можливість насолодитися результатами виконання
    input('Натисніть Enter для продовження')

    print(main_menu)